/***
+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
* 文件名:     Key_Switch.h
* 描述:       按键开关驱动头文件
* 版本号:     v0.1
* 作者:       孙威
* 创建日期:   2021/4/18
*
* @青岛程宁新能源科技有限公司
+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
**/

#ifndef __KEY_SWITCH_H__
#define __KEY_SWITCH_H__

#include "stm32f4xx.h"

/*键值定义*/
#define KEY_MASK 0x01  //按键掩码
#define KEY_1    0x01  //中键

void    Key_Init(void);
uint8_t Key_Get(void);

#endif
